{
  "title": "Our CEO's Journey",
  "subtitle": "Entourage is born out of my ambition, my desire to create a haven for creativity and passion.",
  "signatureName": "Mohammad A. Tayem",
  "signatureTitle": "Founder & CEO",
  "signatureSubtitle1": "Executive member, Young Arab Leaders",
  "signatureSubtitle2": "Board member, International Live Events Association",
  "paragraphs": [
    "I started by finding people who mirror my vision, are courageous enough to stand firmly in the face of a challenge and compliment my unabashed, undying belief in Possibilities.",
    "The last 10 years have been exhilarating; learning, growing, failing and bouncing back again. We have accomplished so much along the way and have learned to conquer challenges and embrace change. ‘Actions speak louder than words’ has always been my personal motto and I have managed to weave it into the fabric of entourage. We don’t make noise, we let the others do that for us. Spanning the last 10 years, we have gained the trust of many regional, local government and the biggest international private entities due to our exceptional work ethic and seamless performance. The Dubai government / Dubai Economic Department evaluated our performance among all other SMEs in the Emirate and we were selected as one of the 100 top SME companies in Dubai 2013 and 2015, ranking #54 and #19, respectively.",
    "What sets us apart is that we don’t change as a response to market demand, we change to elevate the market. We set trends and raise the bar. From being one of the first live communication agencies in the region to being among the first agencies to hold the Middle East Events Awards to me having the honor of being nominated by the Middle East Events Awards in 2018 for “the Industry Icon Award”, we have made our mark.",
    "I am very lucky to work with a team of adventurous people, thrill seekers and this reflects in the work we put out. We have worked on ideas big and small. Some were deemed too ‘crazy, weird, quirky, unrealistic’ and still executed, others are still waiting for people who share the same ethos and believe in us as much as we believe in ourselves. Since the inception of the agency, we built our business to revolve around strategy, so that we can actually add value to the client and not just become executors of somebody else’s vision. Myself and the team have worked on promoting countries, developing Government agendas and have worked on full stream of project management for both, private and government sectors, serving as advisers for big Governmental entities in the region like Mohammed Bin Rashid Foundation, SEHA, United Nations, and Ministry of Tourism of Egypt, to name a few.",
    "We understand that a creative vision can be brought to life only if all parties involved are synergized and work towards achieving the objective of the project. That’s why, we hone partnerships with our clients by becoming an integral part of their team and work as one unit to accomplish the common goal.",
    "I invite you come and be a part of our journey and get a glimpse of some of the amazing work we do.",
    "Welcome home!"
  ]
}
